app/controllers/barbers_controller.rb

    def index
        @barbers = Barber.all
---
SELECT "barbers".* FROM "barbers"

    def show
        begin
            @barber = Barber.find(params[:id])
---
SELECT "barbers".* FROM "barbers" WHERE "barbers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @barber = Barber.new(barber_params)
        if @barber.save
---
INSERT INTO "barbers" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-11 21:51:29.941785"], ["updated_at", "2019-11-11 21:51:29.941785"]]

    def update
        @barber = Barber.find(params[:id])
        @barber.update(barber_params)
---
SELECT "barbers".* FROM "barbers" WHERE "barbers"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "barbers" SET "name" = $1, "updated_at" = $2 WHERE "barbers"."id" = $3  [["name", "Another Test"], ["updated_at", "2019-11-12 22:31:25.885466"], ["id", 10]]

    def destroy
        @barber = Barber.destroy(params[:id])
---
DELETE FROM "barbers" WHERE "barbers"."id" = $1  [["id", 10]]

    def set_barber
        barber = Barber.find(params[:id])
---
SELECT "barbers".* FROM "barbers" WHERE "barbers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]