app/controllers/users_controller.rb

    def show
        begin
            @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("client", "phone", "email", "barber_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["client", "test"], ["phone", "9021040529"], ["email", "test@yahoo.com"], ["barber_id", 2], ["created_at", "2019-11-12 20:00:48.775127"], ["updated_at", "2019-11-12 20:00:48.775127"]]

    def update
        @user = User.find(params[:id])
        @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "client" = $1, "phone" = $2, "email" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["client", "John"], ["phone", "917392378"], ["email", "john@yahoo.com"], ["updated_at", "2019-11-13 04:34:45.903685"], ["id", 10]]

    def destroy
        @user = User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]

    def set_user
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]